In [2]:
import pandas as pd 
import numpy as np

In [3]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                    'key2' : ['one', 'two', 'one', 'two', 'one'],
                    'data1' : np.random.randn(5),
                    'data2' : np.random.randn(5)})

In [4]:
df

  key1 key2     data1     data2
0    a  one  0.863006 -0.402536
1    a  two -0.595785 -1.428888
2    b  one  0.354655  1.993542
3    b  two  0.477835 -0.007236
4    a  one  1.344166 -0.224229

In [5]:
grouped = df['data1'].groupby(df['key1'])

grouped

In [6]:
grouped.mean()

key1
a    0.537129
b    0.416245
Name: data1, dtype: float64

In [8]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

means

key1  key2
a     one     1.103586
      two    -0.595785
b     one     0.354655
      two     0.477835
Name: data1, dtype: float64

In [9]:
means.unstack()

key2       one       two
key1
a     1.103586 -0.595785
b     0.354655  0.477835

In [10]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

years = np.array([2005, 2005, 2006, 2005, 2006])

df['data1'].groupby([states, years]).mean()

California  2005   -0.595785
            2006    0.354655
Ohio        2005    0.670421
            2006    1.344166
Name: data1, dtype: float64